fat23cat/cardputer-hub/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Preserve the production hardware and runtime configuration.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Optimize the production application for flash size. Plan 026 measured this
# independently before excluding unused Wi-Fi feature families below.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# File Storage owns long logical paths below /cardputer-hub. Allocate the FAT
# long-filename work buffer on the heap so adapter calls do not consume a large
# fixed stack buffer.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# BLE-only ESP-NimBLE peripheral with one connection. Scanning roles and the
# Bluedroid host are intentionally excluded.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=16
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_LOG_LEVEL_NONE=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_SC_DEBUG_KEYS=n
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_ENCRYPTION=y
CONFIG_BT_NIMBLE_SM_LVL=3
CONFIG_BT_NIMBLE_SM_SC_ONLY=1
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_INSTANCES=1
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=3

# Wi-Fi station and BLE share the ESP32-S3 radio through software coexistence.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# The product is a Wi-Fi station; it does not host an access point.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Enterprise authentication is outside the supported personal-network scope.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

# Project diagnostics remain informational; identity-bearing Bluetooth host
# diagnostics are disabled separately above.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
